/*
Частина №1

Створити скрипт яки повинен виконувати наступне:

запитати у користувача рік народження;
запитати в нього, в якому місті він живе;
запитати його улюблений вид спорту.

При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:

-його вік;
-якщо користувач вкаже Київ, Вашингтон чи Лондон, то показати йому повідомлення - 
"Ти живеш у столиці..." і на місце точок підставляємо країну, столицею якої є місто. 
-Інакше показуємо йому “ти живеш у місті…”, де місце точок – введене місто.
==================================================================================
Вибираємо самі три види спорту та три чемпіони у цих видах. 
Відповідно, якщо користувач вкаже один із цих видів спорту, то показуємо йому повідомлення 
“Круто! Хочеш стати …? і підставляємо на місце точок ім'я та прізвище чемпіона.
Все це має бути відображено в одному вікні (алерті).

Якщо в якомусь випадку він не захоче вводити інформацію і натисне 
Скасувати, показати йому повідомлення – “Шкода, що Ви не захотіли ввести свій(ю) …” 
і вказуємо, що він не захотів вводити – дату народження, місто чи вид спорту .
*/
// Запитуємо у користувача рік народження


const birthYear = prompt("Введіть свій рік народження:");
if (birthYear === null || isNaN(birthYear)) {
    alert("Шкода, що ви не захотіли ввести свій рік народження.");
} else {
    // Запитуємо у користувача місто проживання
    const city = prompt("Введіть місто, в якому ви живете:");
    if (city === null) {
        alert("Шкода, що ви не захотіли ввести місто в якому ви живете.");
    } else {
        // Запитуємо у користувача улюблений вид спорту
        const sport = prompt("Введіть свій улюблений вид спорту:");
        if (sport === null) {
            alert("Шкода, що ви не захотіли ввести свій улюблений вид спорту.");
        } else {
            // Обчислюємо вік користувача
            const age = 2024 - parseInt(birthYear);

            let cityMessage;
            if (city.toLowerCase() === "київ") {
                cityMessage = `Ти живеш у столиці України.`;
            } else if (city.toLowerCase() === "вашингтон") {
                cityMessage = `Ти живеш у столиці США}.`
            } else if (city.toLowerCase() === "лондон") {
                cityMessage = `Ти живеш у столиці Великої Британії.`;
            } else {
                cityMessage = `Ти живеш у місті ${city}.`;
            }


            let sportMessage;
            switch (sport.toLowerCase()) {
                case "футбол":
                    sportMessage = "Круто! Хочеш грати як Кріштіану Роналду?";
                    break;
                case "теніс":
                    sportMessage = "Круто! Хочеш грати як Новак Джоковіч?";
                    break;
                case "баскетбол":
                    sportMessage = "Круто! Хочеш грати як Кобі Брайант?";
                    break;
                default:
                    sportMessage = `Круто! Хочеш стати чемпіоном з ${sport}?`;
            }


            alert(`${cityMessage} \nТвій вік: ${age} років.\n${sportMessage}`);
        }
    }
}